E:~# sleep 2
E:~# ip -6 addr ls
5: eth0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qlen 1000
    inet6 fe80::1000:ff:fe66:6601/64 scope link 
       valid_lft forever preferred_lft forever
6: eth1: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qlen 1000
    inet6 fe80::1000:ff:fe66:6602/64 scope link 
       valid_lft forever preferred_lft forever
E:~# /sbin/sunshine -v -v -i eth0 -D 
found[1]: lo type=loopback (inactive new)
found[2]: dummy0 type=ether (inactive new)
found[4]: gre0 type=gre (inactive new)
found[5]: eth0 type=ether (inactive new)
   adding as new interface 12:00:00:66:66:01/1200:00ff:fe66:6601
found[6]: eth1 type=ether (inactive new)
   adding as new interface 12:00:00:66:66:02/1200:00ff:fe66:6602
Starting setup for eth0
checking things to do list, has 0 items
iface eth1 has socketfd: -1
iface eth0 has socketfd: 4
iface gre0 has socketfd: -1
iface tunl0 has socketfd: -1
iface dummy0 has socketfd: -1
iface lo has socketfd: -1
sleeping with 1 file descriptors, for 60000 ms
E:~# echo true
true
E:~# checking source 0 -> ready
 eth0: received packet from fe80::1000:ff:fe64:6423 -> ff02::1[6]
 processing dio(36)
 [seq:0,instance:0,rank:0,dagid:0x00 ]
  new RPL node: fe80::1000:ff:fe64:6423 
  does peer 'fe80::1000:ff:fe64:6423' have better rank? (0 < 4294967295)
  Yes, 'fe80::1000:ff:fe64:6423' has best rank 0
  peer 'fe80::1000:ff:fe64:6423' announces prefix: 2001:db8:1::/48
  adding prefix: 2001:db8:1::/48 to iface: eth0
  invoking ip -6 addr add 2001:db8:1:0:1200:ff:fe66:6601/128 dev eth0
5: eth0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qlen 1000
    inet6 2001:db8:1:0:1200:ff:fe66:6601/128 scope global tentative 
       valid_lft forever preferred_lft forever
    inet6 fe80::1000:ff:fe66:6601/64 scope link 
       valid_lft forever preferred_lft forever
6: eth1: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qlen 1000
    inet6 fe80::1000:ff:fe66:6602/64 scope link 
       valid_lft forever preferred_lft forever
checking things to do list, has 0 items
iface eth1 has socketfd: -1
iface eth0 has socketfd: 4
iface gre0 has socketfd: -1
iface tunl0 has socketfd: -1
iface dummy0 has socketfd: -1
iface lo has socketfd: -1
sleeping with 1 file descriptors, for 60000 ms
^C

E:~# : now kill the running daemon
E:~# sunshine -K
Killing process 1045

